[
    {
        "id": "train-with-reece",
        "title": "Train With Reece",
        "description": "Demo fitness site for personal trainers to showcase online services.",
        "image": "/static/images/twr.png",
        "mockup": "/static/images/twr-mockup.png",
        "link": "https://www.twrpt.co.uk",
        "completion_date": "August 2025",
        "website_url": "https://www.twrpt.co.uk",
        "stats": {
            "traffic_increase": "N/A",
            "clients_onboarded": "Actively growing client base"
        },
        "initial_challenge": "Train With Reece (TWR) began with a focus on attracting local personal training clients, but during the project, Reece transitioned fully into online coaching. This shift required a complete rethink of his digital strategy — moving away from local SEO efforts like “personal trainer in Chelmsford” and toward building a strong, professional online brand that could resonate with a remote audience. The challenge was to create a website that not only reflected Reece's energy and expertise but also served as a conversion tool, capable of turning cold visitors into high-intent leads.",
        "solution": "We designed and developed a modern, conversion-focused website built to support Reece's new direction as an online coach. The site communicates his brand clearly and confidently, with focused messaging, intuitive navigation, and a strong visual identity. Key features include mobile-optimized layouts, a frictionless Calendly booking flow, embedded testimonials, and direct calls to action throughout. With performance, clarity, and trust at the core of the design, the site now acts as a powerful digital HQ, helping Reece connect with clients, build authority, and grow his coaching business online."
    },
    {
        "id": "minusu",
        "title": "MINUSU",
        "description": "A creative studio specializing in brand identity, and product design.",
        "image": "/static/images/minusu.jpeg",	
        "mockup": "/static/images/minusu-mockup.png",
        "link": "https://minusu.onrender.com",
        "completion_date": "May 2025",
        "website_url": "https://minusu.onrender.com",
        "stats": {
            "traffic_increase": "261.4%+",
            "clients_onboarded": "8+"
        },
        "initial_challenge": "Minusu, a talented graphic design studio, needed a digital presence that matched the quality of their creative work. Their previous website lacked both visual impact and functional flexibility, it was slow to load, difficult to update, and offered no content management system, which made showcasing new projects cumbersome. Navigation was clunky, and the overall user experience failed to reflect the studio's design sensibility. The challenge was to create a modern, high-performing website that not only highlighted Minusu's portfolio but also supported future growth through easy updates and strategic insights.",
        "solution": "We delivered a streamlined, visually striking website that puts Minusu's work front and center. The design is minimalist by intent, allowing their portfolio to shine without distraction. The site is built for performance, fast load times, seamless transitions, and responsive layouts across devices. We implemented a custom content management system (CMS) tailored for creative workflows, enabling Minusu to easily manage and update their portfolio. A secure contact form improves client communication, while integrated analytics provide actionable data on user engagement. Since launching the site, our collaboration has evolved into a full-service partnership, offering clients a complete online presence package that blends standout web design with brand identity, social media strategy, and more."
    },
    {
        "id": "koala-fit",
        "title": "Koala Fit",
        "description": "Demo fitness site for personal trainers to showcase online services.",
        "image": "/static/images/koala-fit.png",
        "mockup": "/static/images/koala-fit.png",
        "link": "https://koala-fit.onrender.com",
        "completion_date": "June 2025",
        "website_url": "https://koala-fit.onrender.com",
        "stats": {
            "traffic_increase": "N/A",
            "clients_onboarded": "N/A"
        },
        "initial_challenge": "Create a professional, high-converting website to demonstrate what a personal trainer's site could look like. The goal was to show potential clients my ability to design a clean, user-friendly site tailored to fitness professionals.",
        "solution": "I built Koala Fit as a fictional personal training brand to serve as a demo. The site includes key features like service overviews, a contact form, and a booking system, all designed to convert visitors into clients. It showcases my skills in responsive design, custom development, and fitness-focused branding."
    },
    {
        "id": "coming-soon-2",
        "title": "COMING SOON",
        "description": "STAY TUNED",
        "image": "/static/images/coming-soon.png",
        "mockup": "/static/images/coming-soon.png",
        "link": "#",
        "completion_date": "Coming Soon",
        "website_url": "#",
        "stats": {
            "traffic_increase": "TBA",
            "clients_onboarded": "TBA"
        },
        "initial_challenge": "Coming soon...",
        "solution": "Coming soon..."
    }
]