[
    {
        "id": "train-with-reece",
        "title": "Train With Reece",
        "description": "A high-converting website for an online personal trainer focused on brand clarity, trust, and client acquisition.",
        "image": "/static/images/twr.png",
        "mockup": "/static/images/twr-mockup.png",
        "link": "https://www.twrpt.co.uk",
        "completion_date": "August 2025",
        "website_url": "https://www.twrpt.co.uk",
        "stats": {
            "traffic_increase": "N/A",
            "clients_onboarded": "Actively growing client base"
        },
        "initial_challenge": "Train With Reece (TWR) began with a focus on attracting local personal training clients, but during the project, Reece transitioned fully into online coaching. This shift required a complete rethink of his digital strategy — moving away from local SEO efforts like “personal trainer in Chelmsford” and toward building a strong, professional online brand that could resonate with a remote audience. The challenge was to create a website that not only reflected Reece's energy and expertise but also served as a conversion tool, capable of turning cold visitors into high-intent leads.",
        "solution": "We designed and developed a modern, conversion-focused website built to support Reece's new direction as an online coach. The site communicates his brand clearly and confidently, with focused messaging, intuitive navigation, and a strong visual identity. Key features include mobile-optimized layouts, a frictionless Calendly booking flow, embedded testimonials, and direct calls to action throughout. With performance, clarity, and trust at the core of the design, the site now acts as a powerful digital HQ, helping Reece connect with clients, build authority, and grow his coaching business online."
    },
    {
        "id": "coming-soon-2",
        "title": "COMING SOON",
        "description": "STAY TUNED",
        "image": "/static/images/coming-soon.png",
        "mockup": "/static/images/coming-soon.png",
        "link": "#",
        "completion_date": "Coming Soon",
        "website_url": "#",
        "stats": {
            "traffic_increase": "TBA",
            "clients_onboarded": "TBA"
        },
        "initial_challenge": "Coming soon...",
        "solution": "Coming soon..."
    }
]